---
kind: property
id: P:Autodesk.Revit.UI.Events.FormulaEditingEventArgs.CurrentDocument
source: html/aeb4ffc0-5c70-ae78-33b7-88396d2d104b.htm
---
# Autodesk.Revit.UI.Events.FormulaEditingEventArgs.CurrentDocument Property

Returns the current document

## Syntax (C#)
```csharp
public Document CurrentDocument { get; }
```